# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.18-s082_1 on Mon Oct 23 13:29:36 CEST 2023

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design cv32e40s_core

create_clock -name "clk_i" -period 5.0 -waveform {0.0 2.5} [get_ports clk_i]
set_load -pin_load 0.1 [get_ports instr_req_o]
set_load -pin_load 0.1 [get_ports {instr_addr_o[31]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[30]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[29]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[28]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[27]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[26]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[25]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[24]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[23]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[22]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[21]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[20]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[19]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[18]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[17]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[16]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[15]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[14]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[13]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[12]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[11]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[10]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[9]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[8]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[7]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[6]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[5]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[4]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[3]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[2]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[1]}]
set_load -pin_load 0.1 [get_ports {instr_addr_o[0]}]
set_load -pin_load 0.1 [get_ports {instr_memtype_o[1]}]
set_load -pin_load 0.1 [get_ports {instr_memtype_o[0]}]
set_load -pin_load 0.1 [get_ports {instr_prot_o[2]}]
set_load -pin_load 0.1 [get_ports {instr_prot_o[1]}]
set_load -pin_load 0.1 [get_ports {instr_prot_o[0]}]
set_load -pin_load 0.1 [get_ports instr_dbg_o]
set_load -pin_load 0.1 [get_ports instr_reqpar_o]
set_load -pin_load 0.1 [get_ports {instr_achk_o[12]}]
set_load -pin_load 0.1 [get_ports {instr_achk_o[11]}]
set_load -pin_load 0.1 [get_ports {instr_achk_o[10]}]
set_load -pin_load 0.1 [get_ports {instr_achk_o[9]}]
set_load -pin_load 0.1 [get_ports {instr_achk_o[8]}]
set_load -pin_load 0.1 [get_ports {instr_achk_o[7]}]
set_load -pin_load 0.1 [get_ports {instr_achk_o[6]}]
set_load -pin_load 0.1 [get_ports {instr_achk_o[5]}]
set_load -pin_load 0.1 [get_ports {instr_achk_o[4]}]
set_load -pin_load 0.1 [get_ports {instr_achk_o[3]}]
set_load -pin_load 0.1 [get_ports {instr_achk_o[2]}]
set_load -pin_load 0.1 [get_ports {instr_achk_o[1]}]
set_load -pin_load 0.1 [get_ports {instr_achk_o[0]}]
set_load -pin_load 0.1 [get_ports data_req_o]
set_load -pin_load 0.1 [get_ports {data_addr_o[31]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[30]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[29]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[28]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[27]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[26]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[25]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[24]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[23]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[22]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[21]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[20]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[19]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[18]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[17]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[16]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[15]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[14]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[13]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[12]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[11]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[10]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[9]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[8]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[7]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[6]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[5]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[4]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[3]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[2]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[1]}]
set_load -pin_load 0.1 [get_ports {data_addr_o[0]}]
set_load -pin_load 0.1 [get_ports {data_be_o[3]}]
set_load -pin_load 0.1 [get_ports {data_be_o[2]}]
set_load -pin_load 0.1 [get_ports {data_be_o[1]}]
set_load -pin_load 0.1 [get_ports {data_be_o[0]}]
set_load -pin_load 0.1 [get_ports data_we_o]
set_load -pin_load 0.1 [get_ports {data_wdata_o[31]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[30]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[29]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[28]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[27]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[26]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[25]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[24]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[23]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[22]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[21]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[20]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[19]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[18]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[17]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[16]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[15]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[14]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[13]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[12]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[11]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[10]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[9]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[8]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[7]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[6]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[5]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[4]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[3]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[2]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[1]}]
set_load -pin_load 0.1 [get_ports {data_wdata_o[0]}]
set_load -pin_load 0.1 [get_ports {data_memtype_o[1]}]
set_load -pin_load 0.1 [get_ports {data_memtype_o[0]}]
set_load -pin_load 0.1 [get_ports {data_prot_o[2]}]
set_load -pin_load 0.1 [get_ports {data_prot_o[1]}]
set_load -pin_load 0.1 [get_ports {data_prot_o[0]}]
set_load -pin_load 0.1 [get_ports data_dbg_o]
set_load -pin_load 0.1 [get_ports data_reqpar_o]
set_load -pin_load 0.1 [get_ports {data_achk_o[12]}]
set_load -pin_load 0.1 [get_ports {data_achk_o[11]}]
set_load -pin_load 0.1 [get_ports {data_achk_o[10]}]
set_load -pin_load 0.1 [get_ports {data_achk_o[9]}]
set_load -pin_load 0.1 [get_ports {data_achk_o[8]}]
set_load -pin_load 0.1 [get_ports {data_achk_o[7]}]
set_load -pin_load 0.1 [get_ports {data_achk_o[6]}]
set_load -pin_load 0.1 [get_ports {data_achk_o[5]}]
set_load -pin_load 0.1 [get_ports {data_achk_o[4]}]
set_load -pin_load 0.1 [get_ports {data_achk_o[3]}]
set_load -pin_load 0.1 [get_ports {data_achk_o[2]}]
set_load -pin_load 0.1 [get_ports {data_achk_o[1]}]
set_load -pin_load 0.1 [get_ports {data_achk_o[0]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[63]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[62]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[61]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[60]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[59]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[58]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[57]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[56]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[55]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[54]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[53]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[52]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[51]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[50]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[49]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[48]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[47]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[46]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[45]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[44]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[43]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[42]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[41]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[40]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[39]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[38]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[37]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[36]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[35]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[34]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[33]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[32]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[31]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[30]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[29]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[28]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[27]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[26]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[25]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[24]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[23]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[22]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[21]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[20]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[19]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[18]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[17]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[16]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[15]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[14]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[13]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[12]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[11]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[10]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[9]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[8]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[7]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[6]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[5]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[4]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[3]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[2]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[1]}]
set_load -pin_load 0.1 [get_ports {mcycle_o[0]}]
set_load -pin_load 0.1 [get_ports fencei_flush_req_o]
set_load -pin_load 0.1 [get_ports alert_minor_o]
set_load -pin_load 0.1 [get_ports alert_major_o]
set_load -pin_load 0.1 [get_ports debug_havereset_o]
set_load -pin_load 0.1 [get_ports debug_running_o]
set_load -pin_load 0.1 [get_ports debug_halted_o]
set_load -pin_load 0.1 [get_ports debug_pc_valid_o]
set_load -pin_load 0.1 [get_ports {debug_pc_o[31]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[30]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[29]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[28]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[27]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[26]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[25]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[24]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[23]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[22]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[21]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[20]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[19]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[18]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[17]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[16]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[15]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[14]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[13]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[12]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[11]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[10]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[9]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[8]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[7]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[6]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[5]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[4]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[3]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[2]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[1]}]
set_load -pin_load 0.1 [get_ports {debug_pc_o[0]}]
set_load -pin_load 0.1 [get_ports core_sleep_o]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[31]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[30]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[29]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[28]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[27]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[26]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[25]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[24]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[23]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[22]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[21]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[20]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[19]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[18]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[17]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[16]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[15]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[14]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[13]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[12]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[11]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[10]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[9]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[8]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[7]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[6]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[5]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[4]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[3]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[2]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[1]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports {irq_i[0]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports clic_irq_i]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {clic_irq_id_i[4]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {clic_irq_id_i[3]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {clic_irq_id_i[2]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {clic_irq_id_i[1]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {clic_irq_id_i[0]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {clic_irq_level_i[7]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {clic_irq_level_i[6]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {clic_irq_level_i[5]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {clic_irq_level_i[4]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {clic_irq_level_i[3]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {clic_irq_level_i[2]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {clic_irq_level_i[1]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {clic_irq_level_i[0]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {clic_irq_priv_i[1]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {clic_irq_priv_i[0]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports clic_irq_shv_i]
set_input_delay -clock [get_clocks clk_i] -add_delay 2.5 [get_ports wu_wfe_i]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports instr_gnt_i]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports instr_rvalid_i]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[31]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[30]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[29]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[28]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[27]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[26]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[25]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[24]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[23]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[22]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[21]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[20]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[19]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[18]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[17]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[16]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[15]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[14]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[13]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[12]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[11]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[10]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[9]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[8]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[7]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[6]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[5]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[4]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[3]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[2]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[1]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports {instr_rdata_i[0]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports instr_err_i]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports data_gnt_i]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports data_rvalid_i]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[31]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[30]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[29]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[28]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[27]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[26]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[25]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[24]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[23]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[22]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[21]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[20]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[19]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[18]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[17]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[16]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[15]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[14]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[13]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[12]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[11]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[10]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[9]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[8]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[7]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[6]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[5]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[4]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[3]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[2]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[1]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 3.5 [get_ports {data_rdata_i[0]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports data_err_i]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports instr_req_o]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[31]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[30]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[29]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[28]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[27]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[26]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[25]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[24]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[23]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[22]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[21]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[20]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[19]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[18]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[17]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[16]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[15]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[14]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[13]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[12]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[11]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[10]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[9]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[8]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[7]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[6]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[5]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[4]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[3]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[2]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[1]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_addr_o[0]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_memtype_o[1]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_memtype_o[0]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_prot_o[2]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_prot_o[1]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {instr_prot_o[0]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports data_req_o]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports data_we_o]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_be_o[3]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_be_o[2]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_be_o[1]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_be_o[0]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[31]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[30]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[29]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[28]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[27]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[26]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[25]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[24]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[23]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[22]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[21]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[20]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[19]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[18]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[17]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[16]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[15]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[14]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[13]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[12]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[11]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[10]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[9]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[8]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[7]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[6]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[5]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[4]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[3]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[2]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[1]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_addr_o[0]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[31]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[30]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[29]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[28]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[27]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[26]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[25]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[24]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[23]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[22]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[21]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[20]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[19]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[18]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[17]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[16]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[15]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[14]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[13]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[12]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[11]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[10]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[9]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[8]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[7]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[6]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[5]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[4]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[3]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[2]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[1]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_wdata_o[0]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_memtype_o[1]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_memtype_o[0]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_prot_o[2]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_prot_o[1]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {data_prot_o[0]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 4.0 [get_ports fencei_flush_ack_i]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports fencei_flush_req_o]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports debug_req_i]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[31]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[30]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[29]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[28]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[27]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[26]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[25]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[24]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[23]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[22]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[21]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[20]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[19]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[18]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[17]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[16]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[15]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[14]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[13]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[12]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[11]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[10]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[9]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[8]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[7]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[6]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[5]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[4]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[3]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[2]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[1]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {boot_addr_i[0]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[31]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[30]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[29]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[28]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[27]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[26]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[25]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[24]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[23]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[22]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[21]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[20]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[19]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[18]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[17]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[16]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[15]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[14]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[13]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[12]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[11]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[10]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[9]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[8]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[7]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[6]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[5]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[4]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[3]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[2]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[1]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mtvec_addr_i[0]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[31]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[30]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[29]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[28]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[27]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[26]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[25]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[24]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[23]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[22]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[21]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[20]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[19]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[18]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[17]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[16]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[15]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[14]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[13]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[12]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[11]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[10]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[9]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[8]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[7]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[6]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[5]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[4]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[3]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[2]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[1]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_halt_addr_i[0]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[31]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[30]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[29]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[28]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[27]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[26]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[25]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[24]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[23]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[22]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[21]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[20]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[19]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[18]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[17]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[16]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[15]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[14]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[13]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[12]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[11]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[10]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[9]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[8]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[7]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[6]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[5]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[4]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[3]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[2]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[1]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mhartid_i[0]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[31]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[30]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[29]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[28]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[27]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[26]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[25]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[24]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[23]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[22]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[21]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[20]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[19]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[18]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[17]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[16]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[15]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[14]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[13]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[12]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[11]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[10]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[9]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[8]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[7]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[6]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[5]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[4]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[3]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[2]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[1]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {dm_exception_addr_i[0]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports rst_ni]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports scan_cg_en_i]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mimpid_patch_i[3]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mimpid_patch_i[2]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mimpid_patch_i[1]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports {mimpid_patch_i[0]}]
set_input_delay -clock [get_clocks clk_i] -add_delay 0.5 [get_ports fetch_enable_i]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[63]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[62]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[61]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[60]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[59]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[58]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[57]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[56]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[55]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[54]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[53]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[52]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[51]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[50]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[49]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[48]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[47]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[46]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[45]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[44]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[43]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[42]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[41]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[40]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[39]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[38]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[37]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[36]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[35]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[34]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[33]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[32]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[31]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[30]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[29]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[28]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[27]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[26]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[25]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[24]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[23]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[22]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[21]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[20]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[19]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[18]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[17]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[16]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[15]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[14]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[13]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[12]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[11]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[10]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[9]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[8]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[7]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[6]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[5]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[4]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[3]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[2]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[1]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {mcycle_o[0]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports alert_minor_o]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports alert_major_o]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports debug_havereset_o]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports debug_running_o]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports debug_halted_o]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports debug_pc_valid_o]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[31]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[30]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[29]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[28]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[27]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[26]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[25]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[24]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[23]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[22]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[21]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[20]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[19]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[18]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[17]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[16]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[15]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[14]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[13]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[12]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[11]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[10]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[9]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[8]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[7]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[6]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[5]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[4]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[3]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[2]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[1]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 3.0 [get_ports {debug_pc_o[0]}]
set_output_delay -clock [get_clocks clk_i] -add_delay 1.25 [get_ports core_sleep_o]
